modules/models/Admin.php

SELECT * FROM `admin` WHERE `id`=1
---
    public static function findIdentityByAccessToken($token, $type = null) {
        return static::findOne(['access_token' => $token]);