modules/models/Items.php

    public function getTitle($language = '') {
        if (!$language) return '';
        $it = ItemTitle::find()->where(['itemID' => $this->id, 'languageID' => $language])->one();
---
SELECT * FROM `item_title` WHERE (`itemID` IS NULL) AND (`languageID`=1)

    public function saveData($items) {
        if (isset($items)) {
            if ($this->load($items, '')) {
                if ($this->save()) {
                    if (isset($items['title'])) {
                        foreach ($items['title'] as $i => $t) {
                            $it = ItemTitle::find()->where(['itemID' => $this->id, 'languageID' => $i])->one() ?: new ItemTitle();
                            $it->description = $items['description'][$i];
                            $it->title = $t;
                            $it->itemID = $this->id;
                            $it->languageID = $i;
                            $it->save();
                        }
                    }
                    if (isset($items['colorSectors'])) {
                        $colorSectors = $items['colorSectors'];
                        for ($i = 0; $i < 10; $i++) {
                            $ic = ItemColors::find()->where(['item_id' => $this->id, 'sector_id' => ($i + 1)])->one() ?: new ItemColors();
                            $ic->item_id = $this->id;
                            $ic->sector_id = $i + 1;
                            isset($colorSectors['color_id']) && isset($colorSectors['color_id'][$i]) && $ic->color_id = $colorSectors['color_id'][$i];
                            isset($colorSectors['description_ru']) && isset($colorSectors['description_ru'][$i]) && $ic->description_ru = $colorSectors['description_ru'][$i];
                            isset($colorSectors['description_en']) && isset($colorSectors['description_en'][$i]) && $ic->description_en = $colorSectors['description_en'][$i];
                            $ic->save();
---
INSERT INTO `items` (`source`, `i_type`, `i_usg_type`) VALUES (0, CAST('[\"1\"]' AS JSON), CAST('[\"1011\"]' AS JSON))
UPDATE `items` SET `priority`=0 WHERE `id`=1613
SELECT * FROM `item_title` WHERE (`itemID`=1619) AND (`languageID`=1)
INSERT INTO `item_title` (`description`, `title`, `itemID`, `languageID`) VALUES ('умение воспроизводить мелодию на слух', 'воспроизведение мелодии', 1619, 1)
SELECT * FROM `item_colors` WHERE (`item_id`=1619) AND (`sector_id`=1)
INSERT INTO `item_colors` (`item_id`, `sector_id`, `color_id`, `description_ru`, `description_en`) VALUES (1619, 1, '1', '', '')

    public function getUsgType() {
        $result = '';
        !is_array($this->i_usg_type) && $this->i_usg_type = array($this->i_usg_type);
        foreach ($this->i_usg_type as $type) {
            $usg_type = UsgType::findOne(['id' => $type]);
---
SELECT * FROM `usg_type` WHERE `id`='120733'

    public function getColorSector($i) {
        return ItemColors::find()->where(['item_id' => $this->id, 'sector_id' => $i])->one();
---
SELECT * FROM `item_colors` WHERE (`item_id` IS NULL) AND (`sector_id`=1)