modules/controllers/ItemsController.php

    public function actionIndex() {
        $step = Yii::$app->request->get('step');
        $pill = Yii::$app->request->get('pill') ?: 1;
        $steps = Items::getSteps($pill);
        $status = Yii::$app->request->get('status') ?: 1;
        $step = (isset($steps[$step])) ? $step : ($steps ? min(array_keys($steps)) : 1);
        $searchModel = new ItemsSearch();
        $dataProvider = $searchModel->search('', $pill, $step, $status);
        $usgTypes = UsgType::find()->all();
---
SELECT * FROM `usg_type`

    public function actionCreate()
    {
        $model = new Items();

        if ($this->request->isPost) {
            $items = Yii::$app->request->post('Items');
            $model->source = 0;
            $model->saveData($items);
            return $this->redirect('/admin/items/index?pill=2');
        }

        $languages = Language::find()->all();
---
SELECT * FROM `language`

    public function actionCheckpsychologist() {
        $role = Yii::$app->admin->getIdentity()->role;
        if (in_array($role, [1, 3])) {
            $itemID = Yii::$app->request->post('itemID');
            $item = Items::findOne($itemID);
            $item->check3 += 1;
            $item->save();
---
SELECT * FROM `items` WHERE `id`='1616'
UPDATE `items` SET `check3`=1 WHERE `id`=1616

    protected function findModel($id)
    {
        if (($model = Items::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `items` WHERE `id`='1613'