modules/controllers/UsgTypeController.php

SELECT `id`, `name` FROM `usg_type` WHERE `single`=1
---
    public function actionGetTypes($type) {
        $type = json_decode($type);
        $types = UsgType::find()->select('id, name');
        in_array(1, $type) && $types->orFilterWhere(['single' => 1]);
        in_array(2, $type) && $types->orFilterWhere(['multiple' => 1]);
        $types = \yii\helpers\ArrayHelper::map($types->asArray()->all(), 'id', 'name');