modules/views/items/_form.php

    <div class="row">
        <div class="col-2">
            <?= $form->field($model, 'i_type')->dropDownList(Items::getITypes(), ['multiple' => 'multiple', 'class' => 'required form-control item-type select2']); ?>
            <?= $form->field($model, 'i_usg_type')->dropDownList(
                \yii\helpers\ArrayHelper::map(\app\modules\models\UsgType::find()->asArray()->all(), 'id', 'name'),
                ['multiple' => 'multiple', 'class' => 'required form-control item-usage-type select2', 'value' => $model->i_usg_type]
            ); ?>
---
SELECT * FROM `usg_type`