models/User.php

    public static function findByUsername($username){
        return self::findOne(['username' => $username]);
---
SELECT * FROM `user` WHERE `id`=1